{"Jacob Ben-Ami": "Jacob Ben-Ami (November 23 or December 23, 1890, Minsk, Russian Empire – July 2, 1977, New York City, New York, United States) was a noted Belarusian-born Jewish stage actor who performed equally well in Yiddish and English.", "Moyshe Broderzon": "Moishe Broderzon (Yiddish: משה בראדערזאן, November 23, 1890 — August 17, 1956) was a Yiddish poet, theatre director, and the founder of the Łódź literary group Yung-yidish.\nHe was born 1890 in Moscow, but his family was among the Jews expelled in 1891. His father moved to Łódź; his mother took her children to her father's home in Nesvizh (now in Belarus). In 1900, the family was reunited in Łódź.He became a bookkeeper and began writing short narratives in the Yiddish press in Łódź. In 1914 he issued a collection of his poems called Shvartse fliterlekh (Black Spangles). He was a founder of Yung-Yidish artists collaborative.\n [Broderson's] extravagant appearance quickly made an impression on the Yiddish cultural circles organized around the tutelary figure of the Yiddish and Hebrew writer Yitschak Katzenelson. Broderzon had long, thick black hair, Pushkin-style sideburns, and a black shirt characteristic of a Russian worker. He was the only poet in Łódź to wear amber and coral necklaces, and rings on his fingers..\nWhen the Germans invaded Łódź, Broderson removed to Moscow and began publishing his poetry in the Yiddish press. With friends he established the Krayzl fun Yidish Natsyonaler Estetik (Circle for Jewish National Aesthetic). In 1918 he founded (with El Lissitzky, and writers Daniel Tsharni, Gershon Broyde, and Menashe Halpern) the Moscow Circle of Jewish Writers and Artists.In 1918, at the age of 28, Broderzon returned to Łódź. He was a founder of the literary group Yung-yidish, which published a journal of the same name. The journal featured poetry, prose, and experimental art. His wife, Sheyne-Miryam, was an actress famed for a chasidic dance routine.Broderzon also founded several theatres in Łódź: In 1922, with Yekhezkl-Moyshe Nayman, Yitschok Broyner, and Henech Kon he created the Yiddish Marionette Theater Khad Gadyo (Chad-gadye, Khad-gadye), and Shor habor, a variety theater. In 1924 he and Henekh Kon wrote the music for the first Yiddish opera performed in Warsaw, Dovid un Basheve (David and Bathseba), performed in Warsaw's Kaminski Theater; he also wrote a libretto for the opera Monish based on I. L. Peretz's epic romantic poem. In 1926 he began writing for the Azazel theater cafe in Warsaw. In 1927 he was one of the founders of the kleynkunst stage Ararat in Łódź, an experimental theater that featured the actors Shimon Dzigan and Israel Shumacher. He often wrote articles about Yiddish theater.\nHis final lyrics, which appeared in 1939 with the single letter Yud as title, comprise 50 poems of 16 lines each, laden with tragic premonitions of the end of Polish Jewry in a coming world catastrophe.\nHe and his wife, Sheyne Miriam, escaped from Poland into the Soviet Union in 1939 after the Nazi invasion. They worked in the Yiddish theatre in Moscow and became Soviet citizens. He was arrested in April 1950, sentenced to ten years in prison, and sent to Siberia. After five years in a labor camp he was \"rehabilitated\" in September 1955 and was allowed to return to Poland in July 1956; he was greeted there by a small number of literati who had reunited after the war. \"But in despair at seeing a Poland that had become a Jewish cemetery and weakened by years in a labor camp, he died of a heart attack in Warsaw on 17 August 1956.\"Moshe Broderson was buried in the Jewish cemetery at Okopowa Street in Warsaw. After the devastation of the grave, his daughter Anetta (born 1920) transported her father's ashes to Israel to the Kiryat Sha'ul cemetery in Tel Aviv. Posthumously, his texts were used in performances of the Jewish Theatre in Warsaw: Sure Szejndl from 1966 and The Great Win from 1972 and 1985.", "Joseph Buloff": "Joseph Buloff (December 6, 1899 – February 27, 1985) was a Jewish actor and director known for his work in Broadway and Yiddish theatre. He received the Itzik Manger Prize for contributions to Yiddish letters in 1974.", "Joseph Edelstein": "Joseph Edelstein (Yiddish: יוסף עדלשטײן, 1858–1940) was an actor in Yiddish Theatre in America.", "Hertz Grosbard": "Hertz Grosbard (1892−1994) performed recitations of Yiddish literature during the 20th century. He was born in Lodz to a religious family. During the 1920s he began performing what came to be known as his “word concerts” to great critical acclaim. During the \"word concerts\" he recited classics of Yiddish literature such as works of Itsik Manger and Scholem Aleichem. He was very popular and performed extensively both in Europe, the Americas, and in Israel, e.g. in Vilnius he performed more than 50 times between 1928 and 1940. Ten albums with selections of his word concerts were issued in the 1950s and 1960s. He held his last concert in 1992 in Holon, Israel, in conjunction with his 100th birthday.", "Alter Kacyzne": "Alter Kacyzne ((Yiddish: אַלטער קאַציזנע, Alter Kacizne; 31 May 1885 in Vilnius, Russian Empire – 7 July 1941 in Ternopil, General Government for the Occupied Polish Territories) was a Jewish (Yiddish) writer, poet and photographer, known as one of the most significant contributors to Jewish-Polish cultural life in the first half of the 20th century. Among other things, he is particularly known as a photographer whose work immortalised Jewish life in Poland in the 1920s and 1930s.\n\n", "Leyb Kadison": "Mascha Benya (Yiddish: מאַשאַ בעניאַ, 1908-2007), born Masha Benyakonsky, was a Russian-born soprano known especially for her promotion and performance of Yiddish and Hebrew folk and art music in the United States after World War II. After a short career as an opera singer in the Jüdischer Kulturbund in 1930s Berlin, she emigrated to New York after Kristallnacht and became an important figure in the teaching of Yiddish and Hebrew song through the Workman's Circle, Kaufman Music Center, and other organizations, as well as a touring singer, radio performer, and recording artist.", "Luba Kadison": "Luba Kadison Buloff (December 13, 1906 – May 4, 2006) was a Lithuanian Jewish actress, active for decades in Yiddish theatre, in both Europe and the United States.", "Ida Kaminska": "Ida Kamińska (September 18, 1899 – May 21, 1980) was a Polish actress and director. Known mainly for her work in the theatre, she was the daughter of Avrom Yitshok Kaminski (Abraham Isaac Kaminski) and Ester Rachel Kamińska (née Halpern), known as the Mother of the Jewish Stage. The Jewish Theatre in Warsaw, Poland is named in their honor. In her long career Kamińska produced more than 70 plays, and performed in more than 150 productions. She also wrote two plays of her own and translated many works in Yiddish. World War II disrupted her career, and she later immigrated to the United States where she continued to act. In 1967, she directed herself in the lead role of Mother Courage and Her Children on Broadway. In 1973, she released her autobiography, titled My Life, My Theater.She starred in the 1965 film The Shop on Main Street, which won the Academy Award for Best Foreign Film. For her performance, she received special mention at the Cannes Film Festival, as well as nominations for the Golden Globe Award and the Academy Award for Best Actress.", "Leon Kolker": "Joseph Henry Kolker (November 13, 1874 [some sources 1870] – July 15, 1947) was an American stage and film actor and director.", "Henekh Kon": "Henech Kon or Henryk Kon (9 August 1890 – 20 April 1972) was a Polish composer and cabaret performer.\nKon was born in Łódź to a Chassidic family, and sent at the age of 12 to his grandfather in Kutno, where he studied Torah but also studied with local klezmers, absorbing folk music from players and badkhonim. When his family realized he would never be a rabbi, they sent him to music school in Berlin.\nIn 1912 he returned to Poland where he was drawn into literary artistic circles of Jewish Warsaw, particularly the \"artistic culture salon\" of the famous Polish actress Tea Artsishevska (née Miryam Isroels), later a member of the revi-teater Azazel. Her then husband, sculptor Bernard Kratko, introduced Kon to Isaac Leib Peretz and Kon set several of Peretz's works to music, including Treyst mayn folk (Comfort My People) and the play Bay nakht oyfn alten mark (A Night in the Old Marketplace).\nIn 1922 \"proletarian Lodz was tired of earnest dramas and light comedies.\" Responding to the new popularity of satire, Kon – with poet Moishe Broderzon and painter Yitschok Broyner – created the marionette theater Chad-Gadya, the first of a string of revi-teaters (venues for music theater revues) in Polish towns and cities.\n\nHenekh Kon was Moyshe Broderson's closest collaborator, building with him all the kleynkunst theaters in Poland: the marionette-theater Khad-Gadye (1922) in Lodz, the kleynkunst theater Azazel (1925) in Warsaw, Sambatiyon (1926) and Ararat (1927). His was the musical spirit behind all of them.\nHe later was also closely associated with the kleynkunst (small art) venue Ararat. He composed music for around 40 theater productions, including Sholem Asch's Kiddush ha-Shem, Shakespeare's Shylock, Aaron Zeitlin's (Tseytlin's) Yidnshtot, Moshe Lipshitz' Hershele Ostropolyer, Dovid Bergelson's Di broytmil (The Bread Mill), H. Leyvik's Der Golem, and many others.\nHis opera David and Batsheba was written (with Moishe Broderzon) and presented in Warsaw in 1924, in a piano version. Kon himself sang in the production, as did Moshe Shneur's chorus. Ninety-five years later, the orchestral version was created in Weimar, on 16 August 2019, during the Yiddish Summer Weimar Festival.He is strongly associated with the Warsaw Yung-teater, the Yiddish avant-garde theater company which emerged from Michal Weichert's Yiddish Theater Studio. He wrote the music for Boston, about Sacco and Vanzetti, Trupe Tanentzap, an Abraham Goldfaden spectacle, Napoleon's Treasure, based on a Sholem Aleichem story, and many others.\nAfter the Second World War Henoch Kon worked with the Yiddish Art Theater in Paris. Beginning in 1934 he also worked in film; he composed the music for The Dibbuk and Zygmunt Turkow's Di freylekhe kabtsonim (The Jolly Paupers), among others. He moved to America, where he was never particularly successful, and died in New York City.\n\n", "Leon Liebgold": "Leon Liebgold (July 31, 1910, Kraków – September 3, 1993, New Hope, Pennsylvania) was an actor in the Yiddish theatre and in Yiddish language films, both in his native Poland and later in the United States, to which he emigrated. Liebgold is best known for his roles in The Dybbuk (1937), made in Poland, and Tevya (1939), a U.S. production. He was also featured in the highly successful 1936 film Yidl Mit'n Fidl with Molly Picon.\nLiebman began his career as a vaudeville performer and actor on stages in Poland. He married his frequent co-star, Lili Liliana (1913-1989), also rendered in English as \"Lily\" or \"Lilly,\" in 1935. After completing The Dybbuk, Liebgold and Liliana left Poland with their troupe, \"Di Yidishe Bande,\" for a world tour, appearing in Lithuania, Latvia, Belgium, and France. In 1939, when World War II broke out, they were in the United States, thus fortuitously escaping the Holocaust.Liebgold served in the United States Army as a sergeant during World War II, and then performed as a stage actor in Yiddish theaters in America for decades, including the Folksbiene Theater. He and Liliana also toured South America in the 1950s. In the late 1970s, he served as president of the Hebrew Actors' Union in Manhattan, New York.Liebgold possessed both a resonant and fine melodic, cantorial-type voice which embellished both his speaking and singing on stage.\nLiebgold died in 1993 at age 83. He and Liliana, married nearly 60 years until she predeceased him in 1989, are buried together at Mount Hebron Cemetery, in Queens, New York.", "Baruch Lumet": "Baruch Lumet (Burech Lumet; 16 September 1898 – 8 February 1992) was an American actor best known for his work in the Yiddish theatre.", "Meir Melman": "Ida Kamińska (September 18, 1899 – May 21, 1980) was a Polish actress and director. Known mainly for her work in the theatre, she was the daughter of Avrom Yitshok Kaminski (Abraham Isaac Kaminski) and Ester Rachel Kamińska (née Halpern), known as the Mother of the Jewish Stage. The Jewish Theatre in Warsaw, Poland is named in their honor. In her long career Kamińska produced more than 70 plays, and performed in more than 150 productions. She also wrote two plays of her own and translated many works in Yiddish. World War II disrupted her career, and she later immigrated to the United States where she continued to act. In 1967, she directed herself in the lead role of Mother Courage and Her Children on Broadway. In 1973, she released her autobiography, titled My Life, My Theater.She starred in the 1965 film The Shop on Main Street, which won the Academy Award for Best Foreign Film. For her performance, she received special mention at the Cannes Film Festival, as well as nominations for the Golden Globe Award and the Academy Award for Best Actress.","Miriam Orleska": "Miriam Orleska (Yiddish: מרים אָרלעסקאָ; 1900 in Warsaw – 1943 in Treblinka extermination camp) was an actress in the Vilna Yiddish theatre, best known for her role as Leah in S. Ansky's The Dybbuk.", "Andrzej Pronaszko": "Andrzej Pronaszko (31 December 1888 in Derebchyn - 15 January 1961 in Warsaw) was a Polish painter and scenographer, one of the most prominent representatives of the Young Poland movement and the Polish avant-garde of the 1920s and 1930s, Zbigniew Pronaszko's brother.\nIn occupied Poland, Pronaszko was a member of the Polish resistance, and a director of the Department of Microphotography at the Bureau of Information and Propaganda of Armia Krajowa. He was also involved with the underground theatre.\nAfter the war Pronaszko became the lecturer at the Academy of Theatre in Warsaw (Akademia Teatralna im. Aleksandra Zelwerowicza).\n\n", "Yankev Shternberg": "Yankev Shternberg (in English language texts occasionally referred to as Jacob Sternberg; Yiddish: יעקבֿ שטערנבערג; Russian: Яков Моисеевич Штернберг; 1890, Lipcani, Bessarabia, Russian Empire – 1973, Moscow, USSR) was a Yiddish theater director, teacher of theater, playwright, avant-garde poet and short-story writer, best known for his theater work in Romania between the two world wars.", "Zygmunt Turkow": "Zygmunt Turkow (6 November 1896 – 20 January 1970) was a Polish actor, playwright, and director of Jewish origin from Warsaw, who became famous for roles in the pre-war Jewish films and stage plays in Yiddish. His brother, Jonas Turkow, was also a noted actor and stage manager.\nShortly after German invasion of Poland in 1939 he left Poland together with his second wife. In 1940 he settled in Brazil. In 1952 he moved to Israel.\nTurkow produced works by Iso Szajewicz at the Nowości Theatre where he worked for many years.\nHe was the founder of several notable theatres, including the Central Theatre in 1921, co-founder of the Brazilian National Theatre in 1940 and the traveling Zuta Theatre in Tel Aviv, Israel in 1956, where he served as manager and director.Zygmunt Turkow Theatre is named in his honor.", "Mordechai Yachson": "Leon Liebgold (July 31, 1910, Kraków – September 3, 1993, New Hope, Pennsylvania) was an actor in the Yiddish theatre and in Yiddish language films, both in his native Poland and later in the United States, to which he emigrated. Liebgold is best known for his roles in The Dybbuk (1937), made in Poland, and Tevya (1939), a U.S. production. He was also featured in the highly successful 1936 film Yidl Mit'n Fidl with Molly Picon.\nLiebman began his career as a vaudeville performer and actor on stages in Poland. He married his frequent co-star, Lili Liliana (1913-1989), also rendered in English as \"Lily\" or \"Lilly,\" in 1935. After completing The Dybbuk, Liebgold and Liliana left Poland with their troupe, \"Di Yidishe Bande,\" for a world tour, appearing in Lithuania, Latvia, Belgium, and France. In 1939, when World War II broke out, they were in the United States, thus fortuitously escaping the Holocaust.Liebgold served in the United States Army as a sergeant during World War II, and then performed as a stage actor in Yiddish theaters in America for decades, including the Folksbiene Theater. He and Liliana also toured South America in the 1950s. In the late 1970s, he served as president of the Hebrew Actors' Union in Manhattan, New York.Liebgold possessed both a resonant and fine melodic, cantorial-type voice which embellished both his speaking and singing on stage.\nLiebgold died in 1993 at age 83. He and Liliana, married nearly 60 years until she predeceased him in 1989, are buried together at Mount Hebron Cemetery, in Queens, New York."}